{"pageProps":{"posts":[{"title":"Kubernetes에서 GPU 사용하기","date":"2023-10-29T00:00:00.000Z","tags":["kubernetes"],"images":["/static/images/social-banner.png"],"summary":"Pytorch를 컨테이너로 띄우고 GPU를 사용하고 싶었다. 따라서 Docker container에서 NVIDIA GPU를 사용할 수 있도록 셋팅을 해보았다. 그리고 최종적으로 Kubernetes에서 GPU hardware를 사용할 수 있도록 nvidia device plugin을 DaemonSet으로 띄우고 Pod를 실행해보았다.","slug":"20231029-gpu-on-k8s"},{"title":"aws-ebs-csi-driver 코드로 csi driver 이해하기","date":"2023-10-21T00:00:00.000Z","tags":["kubernetes"],"images":["/static/images/social-banner.png"],"summary":"aws-ebs-csi-driver 소스코드를 보고 csi driver가 하는 역할을 이해해보았다. 크게 Controller plugin과 Node plugin으로 구성되어 있고, 다양한 sidecar container들이 존재한다. 이 sidecar container들이 Volume을 생성하고, 노드에 부착하고, Host 혹은 container directory에 mount하는 것을 진행한다. 이과정에서 CSI driver로 cloud vendor마다 다른 로직으로 그들의 volume을 제어하게 된다. 네이버 클라우드에서 storage가 처음 생성될 때 서버에 부착이 되어야만 하는 제약사항이 있어서, PVC로 PV 동적 할당을 할 때 volumeBindingMode이 Immediate이면 자동으로 Node에 부착이 된다.","slug":"20231021-csi-driver"},{"title":"ECR Credential-Provider 사용해보기","date":"2023-09-28T00:00:00.000Z","tags":["kubernetes"],"summary":"Kubeadm으로 만든 Kubernetes Cluster에서 AWS ECR를 private container image repository를 사용하고자 하였다. private repository를 접근하기 위해서 Kubernetes 1.26부터 stable feature로 제공하는 kubelet crendential provider를 사용하였다.","slug":"20230928-ecr-credential-provider"},{"title":"오픈소스 Kubernetes External Secrets 살펴보기","date":"2023-07-30T00:00:00.000Z","tags":["kubernetes"],"summary":"CRD와 Custom Controller를 사용하는 프로젝트에 대해서 더 알고 싶은 상황에서, External Secrets이라는 프로젝트를 발견하게 되었다. External Secrets는 Vault, AWS secret manager와 같이 secret 관리하는 Tool들과 Kubernetes secret을 CRD을 통해서 sync할 수 있게 해준다. 이 프로젝트는 kubebuilder를 사용하였는데, 소스코드를 보면서 어떻게 구현한 건지 자세히 살펴보았다.","slug":"20230730-k8s-controller-external-secrets"},{"title":"Calico kube-controller 이해하기","date":"2023-07-22T00:00:00.000Z","tags":["kubernetes","calico"],"summary":"Calico에서 어떻게 CRD를 활용하는지 이해하기 위해서 Calico Opensource 버전의 깃헙 소스코드를 살펴보게 되었다. Calico archiecture에서 kube-controller 부분이 어떤 역할을 하는지 소스 코드를 통해서 이해할 수 있게 되었다. kube-controller들은 kubernetes native resource에 대한 변경을 calico data store와 sync해주는 역할을 하고 있다. 내가 사용하는 Minikbue Kubernetes Cluster에서는 Calico의 data store는 kubernetes로 설정되어 있기 때문에, CRD로 Calico data들이 저장되고 Felix가 이것을 watch하여 변화에 대해서 network rule을 업데이트 하게 된다.","slug":"20230722-calico-kube-controller"},{"title":"if(kakao)2022 Testing Kubernetes Controller 발표 따라 만들기","date":"2023-07-16T00:00:00.000Z","tags":["kubernetes"],"summary":"어제는 Programming Kubernetes에 나오는 예제를 kubebuilder로 작성해보았다. if(kakao)2022에서 controller를 테스트하는 방법에 대해서 설명한 발표가 있었다. 어제 이해한 내용을 바탕으로 이 발표에서 사용한 BlueGreen controller 예제를 따라서 작성해보았다.","slug":"20230716-if-kakao-2022-k8s-controller"},{"title":"Kubernetes custom controller 작성해보기","date":"2023-07-15T00:00:00.000Z","tags":["kubernetes"],"summary":"Programming Kubernetes 책에서 나온 예제를 따라서 custom controller를 작성해보았다. CustomResourceDefinition를 어떻게 정의하고, kubebuilder로 어떻게 나만의 business logic을 작성할 수 있는지 예제를 통해서 이해했다.","slug":"20230715-k8s-controller"},{"title":"흑역사 하나 더 만들기","date":"2023-07-03T00:00:00.000Z","tags":["kubernetes","presentation"],"summary":"오늘 대왕 흑역사를 생산했다. Kubernetes Community Days에서 발표를 하게 되었는데, 30분 발표시간에 맞춰서 발표자료를 잘 준비하지 못해서 부끄러웠다. 30분에 너무 많은 내용을 담을려고 했고, 라이브코딩 형식으로 해서 시간도 많이 걸렸다. 나는 발표를 왜 할까?","slug":"20230703-k8s-community-days"}],"tag":"kubernetes"},"__N_SSG":true}